#!/bin/bash

# 0. تعريف المستخدم (خطوة ضرورية جداً لنظام بايثون/ديبايان الجديد عشان VNC يشتغل)
export USER=root

# 1. تنظيف ملفات الكاش القديمة عشان لو السيرفر عمل ريستارت الواجهة ما تعلقش
rm -rf /tmp/.X1-lock /tmp/.X11-unix/X1 /tmp/.X0-lock /tmp/.X11-unix/X0

# 2. تشغيل شاشة VNC داخلياً (الواجهة الرسومية اللي هتفتح فيها المتصفح)
tightvncserver :1 -geometry 1280x720 -depth 24

# 3. إعطاء السيرفر ثانية واحدة عشان يلحق يقوم قبل ما الجسر يشتغل (لتفادي الأخطاء)
sleep 1

# 4. تشغيل الجسر (noVNC) وتوجيهه للشبكة الخارجية (0.0.0.0:8080) في الخلفية
websockify --web=/usr/share/novnc/ 0.0.0.0:8080 localhost:5901 &

# 5. تشغيل بوت الميوزك (المايسترو) في الواجهة الأساسية عشان السيرفر يفضل شغال
python3 run.py
