#!/bin/bash

# 1. تنظيف ملفات الكاش القديمة عشان السيرفر يشتغل بدون أخطاء لو عمل ريستارت
rm -rf /tmp/.X1-lock /tmp/.X11-unix/X1 /tmp/.X0-lock /tmp/.X11-unix/X0

# 2. تشغيل شاشة VNC داخلياً (الواجهة الرسومية XFCE)
# البورت الافتراضي هنا هيكون 5901
vncserver :1 -geometry 1280x720 -depth 24

# 3. تشغيل الجسر (noVNC) لتحويل الشاشة لموقع ويب على بورت 8080
# علامة الـ & في الآخر مهمة جداً عشان دي بتخلي الأمر يشتغل في الخلفية وما يوقفش البوت
/usr/share/novnc/utils/launch.sh --vnc localhost:5901 --listen 8080 &

# 4. تشغيل بوت الموزيك بتاعك (AnnieXBoda)
# ده الأمر الأساسي اللي بيشغل البوت
python3 run.py
